app/controllers/movies_controller.rb

    def index
      @movies = Movie.all
      @sort_column = params[:sort_column]
      @unique_ratings = Movie.distinct('rating').pluck('rating')
      @selected_ratings = nil
      if params.has_key?('sort_column') and Movie.column_names.include?(params[:sort_column])
        @movies = Movie.all.order("#{params[:sort_column]}")
      end
      puts "params -- #{params}"
      if params.has_key?('ratings')
        @selected_ratings = params[:ratings].keys
        @movies = Movie.where(rating: @selected_ratings).all
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY release_date